Show / Hide Table of Contents
Class CrossSectionCreepCoefficientData
Cross-section component creep coefficient data
Inheritance
System.Object
CrossSectionCreepCoefficientData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.CrossSection.ComponentCreepCoefficientDataItem,CI.CrossSection")]
public class CrossSectionCreepCoefficientData
Properties
Improve this Doc   View Source
ComponentIndex
Zero based index of component
Declaration
public List<int> ComponentIndex { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
Improve this Doc   View Source
CreepInput
User-defined curvature for creep coefficient { x = t[day], y = ϕ }
Declaration
public InputValueType CreepInput { get; set; }
Property Value
 Type |  Description
 InputValueType
Improve this Doc   View Source
Humidity
Humidity in the relative value
Declaration
public double Humidity { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NotionalSize
User-defined notional size
Declaration
public double NotionalSize { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NotionalSizeInput
Input type of Notional size
Declaration
public InputValueType NotionalSizeInput { get; set; }
Property Value
 Type |  Description
 InputValueType
Improve this Doc   View Source
UserCreepCoeeficient
User creep coefficient
Declaration
public Polygon2D UserCreepCoeeficient { get; set; }
Property Value
 Type |  Description
 Polygon2D
 Improve this Doc
 View Source